<?xml version="1.0" ?>
<net name="Herdr" version="10">
	<layers>
		<layer id="0" name="img" type="Parameter" version="opset1">
			<data shape="50, 3, 240, 320" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="img">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="actions" type="Parameter" version="opset1">
			<data shape="50, 20, 2" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="actions">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="action_pre.2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 16" offset="0" size="64"/>
			<output>
				<port id="0" precision="FP32" names="action_pre.2.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="action_pre.0.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 16" offset="64" size="64"/>
			<output>
				<port id="0" precision="FP32" names="action_pre.0.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ReduceMean_34/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="5" name="ReduceMean_34/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="ReduceMean_34/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ReduceMean_34/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="ReduceMean_34/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="9" name="ReduceMean_34/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="10" name="ReduceMean_34/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="ReduceMean_34" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="12" name="Sub_38/neg_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="13" name="Sub_38/neg_/EltwiseUnsqueeze_input_port_1/value19484856" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="144" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Sub_38/neg_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="65">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Sub_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="69">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ReduceMax_32/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="17" name="ReduceMax_32/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ReduceMax_32/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="ReduceMax_32/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ReduceMax_32/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="21" name="ReduceMax_32/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="22" name="ReduceMax_32/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="ReduceMax_32" type="ReduceMax" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="63"/>
			</output>
		</layer>
		<layer id="24" name="ReduceMin_33/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="25" name="ReduceMin_33/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="ReduceMin_33/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="ReduceMin_33/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ReduceMin_33/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="29" name="ReduceMin_33/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="30" name="ReduceMin_33/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="ReduceMin_33" type="ReduceMin" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="32" name="Sub_35/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" precision="FP32" names="66"/>
			</output>
		</layer>
		<layer id="33" name="Constant_36" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="168" size="4"/>
			<output>
				<port id="0" precision="FP32" names="67"/>
			</output>
		</layer>
		<layer id="34" name="Mul_37" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="Div_39/reciprocal__input_port_1/value16724829" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="172" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="Div_39/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="Div_39/reciprocal_/EltwiseUnsqueeze_input_port_1/value19404754" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="144" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Div_39/reciprocal_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="68">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Div_39" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="70">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="115" type="Const" version="opset1">
			<data element_type="f32" shape="16, 2" offset="176" size="128"/>
			<output>
				<port id="0" precision="FP32" names="115">
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="MatMul_40" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="72">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Add_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="73">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Relu_42" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="74">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="116" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16" offset="304" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="116">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="MatMul_43" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="76">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Add_44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="77">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="88" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1328" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Transpose_45" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>20</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="78">
					<dim>20</dim>
					<dim>50</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="ReduceMean_2/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="50" name="ReduceMean_2/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ReduceMean_2/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ReduceMean_2/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="ReduceMean_2/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="54" name="ReduceMean_2/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="55" name="ReduceMean_2/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="ReduceMean_2" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="Sub_6/neg_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
			</input>
			<output>
				<port id="1" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="Sub_6/neg_/EltwiseUnsqueeze_input_port_1/value19444862" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1352" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Sub_6/neg_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="30">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Sub_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="34">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="ReduceMax_0/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="ReduceMax_0/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="ReduceMax_0/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="ReduceMax_0/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ReduceMax_0/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="66" name="ReduceMax_0/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="67" name="ReduceMax_0/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="ReduceMax_0" type="ReduceMax" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="28"/>
			</output>
		</layer>
		<layer id="69" name="ReduceMin_1/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="70" name="ReduceMin_1/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="ReduceMin_1/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="ReduceMin_1/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="ReduceMin_1/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="74" name="ReduceMin_1/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="75" name="ReduceMin_1/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="ReduceMin_1" type="ReduceMin" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="Sub_3/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" precision="FP32" names="31"/>
			</output>
		</layer>
		<layer id="78" name="Constant_4" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="168" size="4"/>
			<output>
				<port id="0" precision="FP32" names="32"/>
			</output>
		</layer>
		<layer id="79" name="Mul_5" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="Div_7/reciprocal__input_port_1/value16664808" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="172" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="81" name="Div_7/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="FP32"/>
			</input>
			<output>
				<port id="2" precision="FP32"/>
			</output>
		</layer>
		<layer id="82" name="Div_7/reciprocal_/EltwiseUnsqueeze_input_port_1/value19364760" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1352" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Div_7/reciprocal_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="33">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Div_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="35">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="obs_pre.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 5, 5" offset="1384" size="9600"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.0.weight">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_8/Dims1130" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="10984" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="36">
					<dim>50</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="MaxPool_9" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="4, 4" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="37">
					<dim>50</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="38">
					<dim>50</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="obs_pre.3.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 32, 3, 3" offset="11112" size="73728"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.3.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>32</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_11/Dims1124" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="84840" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="39">
					<dim>50</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="MaxPool_12" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="4, 4" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="40">
					<dim>50</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Relu_13" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="41">
					<dim>50</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="obs_pre.6.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="85096" size="147456"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.6.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_14/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_14/Dims1118" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="232552" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="42">
					<dim>50</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_15" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="43">
					<dim>50</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Flatten_16/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="232808" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Flatten_16/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="44">
					<dim>50</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="obs_pre.9.weight" type="Const" version="opset1">
			<data element_type="f32" shape="256, 3072" offset="232824" size="3145728"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.9.weight">
					<dim>256</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Gemm_17/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="obs_pre.9.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256" offset="3378552" size="1024"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.9.bias">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Gemm_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="45">
					<dim>50</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="46">
					<dim>50</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="obs_pre.11.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256" offset="3379576" size="131072"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.11.weight">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Gemm_19/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="obs_pre.11.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="3510648" size="512"/>
			<output>
				<port id="0" precision="FP32" names="obs_pre.11.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Gemm_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="47">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="init_hidden.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="3511160" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="init_hidden.0.weight">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Gemm_20/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="init_hidden.0.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="3576696" size="512"/>
			<output>
				<port id="0" precision="FP32" names="init_hidden.0.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Gemm_20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="48">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Relu_21" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="49">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="init_hidden.2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128" offset="3577208" size="65536"/>
			<output>
				<port id="0" precision="FP32" names="init_hidden.2.weight">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Gemm_22/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="init_hidden.2.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128" offset="3642744" size="512"/>
			<output>
				<port id="0" precision="FP32" names="init_hidden.2.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Gemm_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="50">
					<dim>50</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Split_23/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="136" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="123" name="Split_23/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3643256" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Split_23/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="51">
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32" names="52">
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="ConstantOfShape_25/Broadcast" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3643272" size="24"/>
			<output>
				<port id="0" precision="I64" names="55">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Expand_26" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="56">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3643272" size="24"/>
			<output>
				<port id="0" precision="I64" names="53">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Tile_27" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="LSTM_46/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>50</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="LSTM_46/ShapeOf/Indices9224721" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="3643296" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="LSTM_46/ShapeOf/Axis9234787" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="128" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="132" name="LSTM_46/ShapeOf/Gather" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="LSTM_46/HiddenStateResizeDim/value9274706" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3643300" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="LSTM_46/HiddenStateResizeDim" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="LSTM_46/HiddenStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="57">
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="ConstantOfShape_29/Broadcast" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3643272" size="24"/>
			<output>
				<port id="0" precision="I64" names="60">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Expand_30" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="61">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Constant_28" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="3643272" size="24"/>
			<output>
				<port id="0" precision="I64" names="58">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Tile_31" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="LSTM_46/CellStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="62">
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="LSTM_46/TensorIterator" type="TensorIterator" version="opset1">
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="2" start="0" end="-1" stride="1" part_size="1"/>
				<input external_port_id="1" internal_layer_id="1"/>
				<input external_port_id="2" internal_layer_id="0"/>
				<output axis="0" external_port_id="3" internal_layer_id="11" start="0" end="-1" stride="1" part_size="1"/>
				<output external_port_id="4" internal_layer_id="13"/>
				<output external_port_id="5" internal_layer_id="12"/>
			</port_map>
			<back_edges>
				<edge from-layer="13" to-layer="1"/>
				<edge from-layer="12" to-layer="0"/>
			</back_edges>
			<input>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>50</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>20</dim>
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>50</dim>
					<dim>64</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="0" name="24" type="Parameter" version="opset1">
						<data shape="50, 64" element_type="f32"/>
						<output>
							<port id="0" precision="FP32">
								<dim>50</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="22" type="Parameter" version="opset1">
						<data shape="50, 64" element_type="f32"/>
						<output>
							<port id="0" precision="FP32">
								<dim>50</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="20" type="Parameter" version="opset1">
						<data shape="1, 50, 16" element_type="f32"/>
						<output>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>50</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="7260" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="128" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="LSTM_46/input_squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0" precision="FP32">
								<dim>1</dim>
								<dim>50</dim>
								<dim>16</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
