<?xml version="1.0" ?>
<net name="Herdr" version="10">
	<layers>
		<layer id="0" name="img" type="Parameter" version="opset1">
			<data shape="30, 3, 480, 640" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="img">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="actions" type="Parameter" version="opset1">
			<data shape="30, 10, 2" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="actions">
					<dim>30</dim>
					<dim>10</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="action_pre.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 16" offset="0" size="32"/>
			<output>
				<port id="0" precision="FP16" names="action_pre.2.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="action_pre.0.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 16" offset="32" size="32"/>
			<output>
				<port id="0" precision="FP16" names="action_pre.0.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="107" type="Const" version="opset1">
			<data element_type="f16" shape="16, 2" offset="64" size="64"/>
			<output>
				<port id="0" precision="FP16" names="107">
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="MatMul_32" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="64">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Add_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="65">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Relu_34" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="66">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="108" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16" offset="128" size="512"/>
			<output>
				<port id="0" precision="FP16" names="108">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="MatMul_35" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="68">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Add_36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="69">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="79" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="640" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Transpose_37" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="70">
					<dim>10</dim>
					<dim>30</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="ReduceMean_2/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="14" name="ReduceMean_2/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="ReduceMean_2/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ReduceMean_2/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="ReduceMean_2/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="18" name="ReduceMean_2/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="672" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="19" name="ReduceMean_2/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ReduceMean_2" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="21" name="Sub_6/neg_/Negate" type="Negative" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="22" name="Sub_6/neg_/EltwiseUnsqueeze_input_port_1/value15923773" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="680" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Sub_6/neg_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="30">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Sub_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="34">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ReduceMax_0/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="26" name="ReduceMax_0/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="ReduceMax_0/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ReduceMax_0/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ReduceMax_0/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="30" name="ReduceMax_0/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="672" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="31" name="ReduceMax_0/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="ReduceMax_0" type="ReduceMax" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="28"/>
			</output>
		</layer>
		<layer id="33" name="ReduceMin_1/axes_input_port_0/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="34" name="ReduceMin_1/range_end/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="ReduceMin_1/range_end/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="ReduceMin_1/range_end/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="ReduceMin_1/range_end" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="38" name="ReduceMin_1/axes_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="672" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="39" name="ReduceMin_1/axes" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ReduceMin_1" type="ReduceMin" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="41" name="Sub_3/sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" precision="FP16" names="31"/>
			</output>
		</layer>
		<layer id="42" name="Constant_4" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="712" size="2"/>
			<output>
				<port id="0" precision="FP16" names="32"/>
			</output>
		</layer>
		<layer id="43" name="Mul_5" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="44" name="Div_7/reciprocal__input_port_1/value13753791" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="714" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="45" name="Div_7/reciprocal_" type="Power" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="FP16"/>
			</input>
			<output>
				<port id="2" precision="FP16"/>
			</output>
		</layer>
		<layer id="46" name="Div_7/reciprocal_/EltwiseUnsqueeze_input_port_1/value15883839" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="680" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Div_7/reciprocal_/EltwiseUnsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16"/>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="33">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Div_7" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="35">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="obs_pre.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 5, 5" offset="716" size="4800"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.0.weight">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_8/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>3</dim>
					<dim>480</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>32</dim>
					<dim>238</dim>
					<dim>318</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_8/Dims929" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="5516" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>32</dim>
					<dim>238</dim>
					<dim>318</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="36">
					<dim>30</dim>
					<dim>32</dim>
					<dim>238</dim>
					<dim>318</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="MaxPool_9" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="4, 4" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>32</dim>
					<dim>238</dim>
					<dim>318</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="37">
					<dim>30</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="38">
					<dim>30</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="obs_pre.3.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 3, 3" offset="5580" size="36864"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.3.weight">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_11/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>32</dim>
					<dim>118</dim>
					<dim>158</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Conv_11/Dims923" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="42444" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Conv_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="39">
					<dim>30</dim>
					<dim>64</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="MaxPool_12" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" kernel="4, 4" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>58</dim>
					<dim>78</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="40">
					<dim>30</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Relu_13" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="41">
					<dim>30</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="obs_pre.6.weight" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="42572" size="73728"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.6.weight">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Conv_14/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>28</dim>
					<dim>38</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_14/Dims917" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="116300" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="42">
					<dim>30</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Relu_15" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="43">
					<dim>30</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Flatten_16/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="116428" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Flatten_16/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
					<dim>13</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="44">
					<dim>30</dim>
					<dim>14976</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="obs_pre.9.weight" type="Const" version="opset1">
			<data element_type="f16" shape="256, 14976" offset="116444" size="7667712"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.9.weight">
					<dim>256</dim>
					<dim>14976</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Gemm_17/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>14976</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>14976</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="obs_pre.9.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="7784156" size="512"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.9.bias">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Gemm_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="45">
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Relu_18" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="46">
					<dim>30</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="obs_pre.11.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 256" offset="7784668" size="65536"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.11.weight">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Gemm_19/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="obs_pre.11.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="7850204" size="256"/>
			<output>
				<port id="0" precision="FP16" names="obs_pre.11.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Gemm_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="47">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="init_hidden.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="7850460" size="32768"/>
			<output>
				<port id="0" precision="FP16" names="init_hidden.0.weight">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Gemm_20/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="init_hidden.0.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="7883228" size="256"/>
			<output>
				<port id="0" precision="FP16" names="init_hidden.0.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Gemm_20" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="48">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Relu_21" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="49">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="init_hidden.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="128, 128" offset="7883484" size="32768"/>
			<output>
				<port id="0" precision="FP16" names="init_hidden.2.weight">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Gemm_22/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="init_hidden.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="7916252" size="256"/>
			<output>
				<port id="0" precision="FP16" names="init_hidden.2.bias">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Gemm_22" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="50">
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Split_23/VariadicSplit_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="672" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="87" name="Split_23/VariadicSplit_input_port_2/value" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="7916508" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Split_23/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="51">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16" names="52">
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="ConstantOfShape_25/Broadcast" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7916524" size="24"/>
			<output>
				<port id="0" precision="I64" names="55">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Expand_26" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="56">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7916524" size="24"/>
			<output>
				<port id="0" precision="I64" names="53">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Tile_27" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="LSTM_38/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="LSTM_38/ShapeOf/Indices7513809" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="7916548" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="LSTM_38/ShapeOf/Axis7523782" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="LSTM_38/ShapeOf/Gather" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="LSTM_38/HiddenStateResizeDim/value7563806" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="7916552" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="LSTM_38/HiddenStateResizeDim" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="LSTM_38/HiddenStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="57">
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="ConstantOfShape_29/Broadcast" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7916524" size="24"/>
			<output>
				<port id="0" precision="I64" names="60">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Expand_30" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="61">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_28" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="7916524" size="24"/>
			<output>
				<port id="0" precision="I64" names="58">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Tile_31" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="LSTM_38/CellStateResize" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="62">
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="LSTM_38/TensorIterator" type="TensorIterator" version="opset1">
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="2" start="0" end="-1" stride="1" part_size="1"/>
				<input external_port_id="1" internal_layer_id="1"/>
				<input external_port_id="2" internal_layer_id="0"/>
				<output axis="0" external_port_id="3" internal_layer_id="11" start="0" end="-1" stride="1" part_size="1"/>
				<output external_port_id="4" internal_layer_id="13"/>
				<output external_port_id="5" internal_layer_id="12"/>
			</port_map>
			<back_edges>
				<edge from-layer="13" to-layer="1"/>
				<edge from-layer="12" to-layer="0"/>
			</back_edges>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
			<body>
				<layers>
					<layer id="0" name="24" type="Parameter" version="opset1">
						<data shape="30, 64" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="22" type="Parameter" version="opset1">
						<data shape="30, 64" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="20" type="Parameter" version="opset1">
						<data shape="1, 30, 16" element_type="f16"/>
						<output>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>30</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="7254" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="664" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="LSTM_38/input_squeeze" type="Squeeze" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>30</dim>
								<dim>16</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>30</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="LSTM_38/LSTMCell/Split201251" type="Const" version="opset1">
						<data element_type="f16" shape="256, 16" offset="7916560" size="8192"/>
						<output>
							<port id="0" precision="FP16">
								<dim>256</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="LSTM_38/LSTMCell/Split202257" type="Const" version="opset1">
						<data element_type="f16" shape="256, 64" offset="7924752" size="32768"/>
						<output>
							<port id="0" precision="FP16">
								<dim>256</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="LSTM_38/inport/2260" type="Const" version="opset1">
						<data element_type="f16" shape="256" offset="7957520" size="512"/>
						<output>
							<port id="0" precision="FP16">
								<dim>256</dim>
							</port>
						</output>
					</layer>
					<layer id="8" name="LSTM_38/LSTMCell" type="LSTMCell" version="opset4">
						<data hidden_size="64" activations="sigmoid, tanh, tanh" activations_alpha="" activations_beta="" clip="0"/>
						<input>
							<port id="0" precision="FP16">
								<dim>30</dim>
								<dim>16</dim>
							</port>
							<port id="1" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
							<port id="2" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
							<port id="3" precision="FP16">
								<dim>256</dim>
								<dim>16</dim>
							</port>
							<port id="4" precision="FP16">
								<dim>256</dim>
								<dim>64</dim>
							</port>
							<port id="5" precision="FP16">
								<dim>256</dim>
							</port>
						</input>
						<output>
							<port id="6" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
							<port id="7" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="9" name="15248" type="Const" version="opset1">
						<data element_type="i64" shape="1" offset="664" size="8"/>
						<output>
							<port id="0" precision="I64">
								<dim>1</dim>
							</port>
						</output>
					</layer>
					<layer id="10" name="LSTM_38output_unsqueeze" type="Unsqueeze" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
							<port id="1" precision="I64">
								<dim>1</dim>
							</port>
						</input>
						<output>
							<port id="2" precision="FP16">
								<dim>1</dim>
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</output>
					</layer>
					<layer id="11" name="18/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>1</dim>
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</input>
					</layer>
					<layer id="12" name="LSTM_38/outport/1/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</input>
					</layer>
					<layer id="13" name="LSTM_38/outport/0/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0" precision="FP16">
								<dim>30</dim>
								<dim>64</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="8" to-port="2"/>
					<edge from-layer="1" from-port="0" to-layer="8" to-port="1"/>
					<edge from-layer="2" from-port="0" to-layer="4" to-port="0"/>
					<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
					<edge from-layer="4" from-port="2" to-layer="8" to-port="0"/>
					<edge from-layer="5" from-port="0" to-layer="8" to-port="3"/>
					<edge from-layer="6" from-port="0" to-layer="8" to-port="4"/>
					<edge from-layer="7" from-port="0" to-layer="8" to-port="5"/>
					<edge from-layer="8" from-port="6" to-layer="10" to-port="0"/>
					<edge from-layer="8" from-port="7" to-layer="12" to-port="0"/>
					<edge from-layer="8" from-port="6" to-layer="13" to-port="0"/>
					<edge from-layer="9" from-port="0" to-layer="10" to-port="1"/>
					<edge from-layer="10" from-port="2" to-layer="11" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="106" name="7443878" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="LSTM_38/UnsqueezeNumDirections/2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="LSTM_38/UnsqueezeNumDirections/2/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
		<layer id="109" name="7403854" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="664" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="LSTM_38/UnsqueezeNumDirections/1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="LSTM_38/UnsqueezeNumDirections/1/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</input>
		</layer>
		<layer id="112" name="model_out.0.2.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="7958032" size="2"/>
			<output>
				<port id="0" precision="FP16" names="model_out.0.2.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="model_out.0.0.bias" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 32" offset="7958034" size="64"/>
			<output>
				<port id="0" precision="FP16" names="model_out.0.0.bias">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="7363851" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="672" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="LSTM_38/UnsqueezeNumDirections/0" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="92">
					<dim>10</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Squeeze_39/Dims" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="672" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Squeeze_39" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="95">
					<dim>10</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="80" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="640" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Transpose_40" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="96">
					<dim>30</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="129" type="Const" version="opset1">
			<data element_type="f16" shape="32, 64" offset="7958098" size="4096"/>
			<output>
				<port id="0" precision="FP16" names="129">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="MatMul_41" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="98">
					<dim>30</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Add_42" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="99">
					<dim>30</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Relu_43" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="100">
					<dim>30</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="130" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32" offset="7962194" size="64"/>
			<output>
				<port id="0" precision="FP16" names="130">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="MatMul_44" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>30</dim>
					<dim>10</dim>
					<dim>32</dim>
				</port>
